fixtures/vcr_cassettes/ChartMogul_Invoice/API_Interactions/returns_all_invoices_through_list_all_endpoint.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.chartmogul.com/v1/invoices?external_id=invoice_eid&per_page=10
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Authorization:
      - Basic MDFiNzI2YzI0ZjNiYjhlOTc0MmEwNGZiMDhhZmE3NzQ6NzJlNGMxYTdlZTFiYzlkNGZjMDBlZWUwNWIyN2QzMGY=
  response:
    status:
      code: 200
      message:
    headers:
      server:
      - nginx/1.9.10
      date:
      - Wed, 29 Jun 2016 12:45:27 GMT
      content-type:
      - application/json
      content-length:
      - '1297'
      connection:
      - close
      vary:
      - Accept-Encoding
      status:
      - 200 OK
      access-control-allow-credentials:
      - 'true'
    body:
      encoding: UTF-8
      string: '{"invoices":[{"date":"2016-01-01 12:00:00 +0000","currency":"USD","line_items":[{"type":"subscription","subscription_external_id":"test_cus_sub_ext_id","plan_uuid":"pl_209e4674-1258-4a35-8378-9b15c4086965","service_period_start":"2016-01-01
        12:00:00 +0000","service_period_end":"2016-02-01 12:00:00 +0000","amount_in_cents":1000,"cancelled_at":"2016-01-15
        12:00:00 +0000","prorated":false,"quantity":5,"discount_amount_in_cents":1200,"discount_code":"DISCCODE","tax_amount_in_cents":200,"external_id":"test_cus_li_ext_id"}],"transactions":[{"type":"payment","date":"2016-01-01
        12:00:00 +0000","result":"successful","external_id":"test_cus_tr_ext_id"}],"external_id":"invoice_eid","due_date":"2016-01-07
        12:00:00 +0000","customer_uuid":"customer_uuid"}]}'
    http_version:
  recorded_at: Wed, 29 Jun 2016 12:45:27 GMT
recorded_with: VCR 3.0.3
